In [30]:
import pandas as pd
import numpy as np

In [34]:
np.log(-1)

C:\Users\mokpolar\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in log
  """Entry point for launching an IPython kernel.

nan

In [6]:
a = [1, 2, 3, 4, 5]

In [7]:
b = [3, 4, 5, 6, 8]

In [9]:
k = pd.DataFrame(a)

In [10]:
k['b'] = b

In [11]:

k

   0  b
0  1  3
1  2  4
2  3  5
3  4  6
4  5  8

In [14]:
k['b'].shift(-1)

0    4.0
1    5.0
2    6.0
3    8.0
4    NaN
Name: b, dtype: float64

In [25]:
k['b'] - k['b'].shift(periods = 1, axis = 0)

0    NaN
1    1.0
2    1.0
3    1.0
4    2.0
Name: b, dtype: float64

In [26]:
k['b'].shift(periods = 1, axis = 0)

0    NaN
1    3.0
2    4.0
3    5.0
4    6.0
Name: b, dtype: float64

In [28]:
k['b+1'] = k['b'].shift(periods = 1, axis = 0)

In [29]:
k

   0  b  b+1
0  1  3  NaN
1  2  4  3.0
2  3  5  4.0
3  4  6  5.0
4  5  8  6.0